# Pandas 학습

1. 데이터 분석을 위한 모듈
2. excel과 가장 큰 차이점 : Pandas는 대용량 데이터 처리가 가능
3. 데이터 분석 및 데이터 가공에 절대적으로 사용되는 library
4. 주요 학습 내용
> 1. DataFrame - excel의 다수의 컬럼들을 보유한 table과 동일하다 간주
> 2. series - DataFrame을 구성하는 column 간주

**참고**

주피터 노트북 익스텐션을 활용하여 생산성 높이기
>pip install jupyter_contrib_nbextensions && jupyter contrib nbextension install

In [ ]:
# !pip install jupyter_contrib_nbextensions && jupyter contrib nbextension install

## 기초 익히기
> 이미 존재하는 파일의 내용으로 DataFrame 생성하기 <br>
> 중복 데이터 제거 <br>
> 결측시 처리

## DataFrame  & Series 구조 
> https://pandas.pydata.org/docs/getting_started/index.html <br>

In [9]:
# 전처리를 위한 library import
# as 키워드는 library 별칭 부여 : pd 관습적으로 사용

import pandas as pd
import numpy as np

In [2]:
!pip show pandas

Name: pandas
Version: 1.0.5
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page: https://pandas.pydata.org
Author: None
Author-email: None
License: BSD
Location: c:\users\xodlr_000\anaconda3\lib\site-packages
Requires: pytz, numpy, python-dateutil
Required-by: statsmodels, seaborn

기초 익히기

In [7]:
# 시리즈 - 정수값으로 생성시 자동으로 int64 (64bit 저장 가능한 정수)
# 시리즈 생성 문법 
s = pd.Series([1, 2, 3])
s

0    1
1    2
2    3
dtype: int64

In [4]:
type(s)

pandas.core.series.Series

In [5]:
# 시리즈 객체가 보유한 데이터
s.values

array([1, 2, 3], dtype=int64)

In [8]:
s.index

RangeIndex(start=0, stop=3, step=1)

In [17]:
#결측치 - 데이터 값이 없음을 의미, nan(not a number)
# Not a Number : js에서 숫자가 아님을 의미하는 표현법
# pyhton에서는 결측치 의미

# 명시적으로 시리즈에 결측치 적용
# numpy api : 결측치 표현

# 데이터를 관리하기 위해서는 간혹 결측치도 임의로 생성해야 할 경우도 있음

s = pd.Series([1, np.nan, 3, 4, 5, np.nan])
s

0    1.0
1    NaN
2    3.0
3    4.0
4    5.0
5    NaN
dtype: float64

In [18]:
#시리즈에서 결측치를 제외한 유효한 데이터의 개수를 counting
s.count()

4

In [20]:
# 가령 데이터로 연산 작업을 수행
# 최상의 output을 위해 결측치를 처리해야 하는 경우도 있음(삭제 / 대체(평균, 중앙, 최빈... ))

# s.fillna(0) : 결측치를 0으로 치환한 새로운 시리즈 생성
s = s.fillna(0) # 0으로 치환한 시리즈를 재대입
s

0    1.0
1    0.0
2    3.0
3    4.0
4    5.0
5    0.0
dtype: float64

In [23]:
s = pd.Series([1, np.nan, 3, 4, 5, np.nan])
print(s)

s = s.fillna(10)
print(s)

0    1.0
1    NaN
2    3.0
3    4.0
4    5.0
5    NaN
dtype: float64
0     1.0
1    10.0
2     3.0
3     4.0
4     5.0
5    10.0
dtype: float64

In [24]:
# 결측치 삭제 : dropna()
s = pd.Series([1, np.nan, 3, 4, 5, np.nan])

print(s)

s = s.dropna()
print(s)

0    1.0
1    NaN
2    3.0
3    4.0
4    5.0
5    NaN
dtype: float64
0    1.0
2    3.0
3    4.0
4    5.0
dtype: float64

## 날짜와 문자열 데이터 다루기 


- Python의 datetime모듈

>date : 연, 월, 일

>time : 시간, 분, 초, 마이크로초(백만분의 1초)

>datetime : date와 time요소

- Pandas의 Timestamp

>날짜와 시간 모두 포함 : 나노초(10억분의 1초) 단위의 정밀도


- timedelta

>날짜의 덧셈과 뺄셈에 유용

### 특정 날짜를 기준으로 DataFrame생성해 보기

In [25]:
# 6일 치의 날짜 데이터 생성
# data_range(시작일, 범위) : 시작일로부터 해당 범위 날짜까지 자동 생성: 
datas = pd.date_range('20210628', periods=6)
datas

DatetimeIndex(['2021-06-28', '2021-06-29', '2021-06-30', '2021-07-01',
               '2021-07-02', '2021-07-03'],
              dtype='datetime64[ns]', freq='D')

**날짜를 index로 지정해서 DataFrame 객체 생성**

In [26]:
type(datas)

pandas.core.indexes.datetimes.DatetimeIndex

In [71]:
# 6 by 4 : 6행 4열의 데이터 프레임 생성, 데이터는 난수 값

# 실수의 난수 생성함수 : 2행 3열의 실수 난수
print(np.random.randn(2, 3))

# 정수의 난수 생성 함수 : 12<= x < 20 사이의 정수 난수 발생
print(np.random.randint(12, 20))

[[-1.95063546  0.68928565 -0.12754128]
 [-0.37781268 -0.0672045  -0.83405238]]
15

In [40]:
np.random.randint(12)

11

In [73]:
#6행 4열의 구조로 datas 변수값을 index루 구#성하는 DataFrame 객체 생성
#  pandas로 데이터 처리 시 >> numpy 모듈 필수!

df = pd.DataFrame(np.random.randn(6,4), index = datas)
df

                   0         1         2         3
2021-06-28  1.733785  1.183093  0.987198 -0.032567
2021-06-29 -1.297880 -0.669642 -0.657995  0.257532
2021-06-30 -0.287547  1.165809 -1.481406  0.232250
2021-07-01 -0.221165  1.319395  0.233349 -0.300859
2021-07-02 -0.060000  0.744514 -1.555714 -1.443033
2021-07-03 -0.487118  0.430869  0.096008 -0.052766

In [74]:
# 컬럼명 가공
df = pd.DataFrame(np.random.randn(6, 4), index=datas,
                  columns=['a', 'b', 'c', 'd'])
df

                   a         b         c         d
2021-06-28  1.567567 -0.489256 -1.268235 -2.647576
2021-06-29 -0.578794 -1.140927 -0.335001  0.370539
2021-06-30 -2.362943 -0.109236 -0.381152 -0.135555
2021-07-01 -0.637277  0.757169 -1.326453  0.487611
2021-07-02  1.764573 -0.573051 -0.977779  0.294996
2021-07-03  0.283506 -0.308172  0.997574 -1.345483

In [76]:
#df의 value

df.values

array([[ 1.5675669 , -0.48925579, -1.26823531, -2.64757555],
       [-0.57879426, -1.14092673, -0.33500144,  0.37053947],
       [-2.3629429 , -0.10923577, -0.38115199, -0.13555464],
       [-0.63727745,  0.75716879, -1.32645327,  0.48761097],
       [ 1.7645733 , -0.57305081, -0.97777947,  0.29499577],
       [ 0.28350585, -0.30817169,  0.99757394, -1.34548264]])

In [78]:
df.index

DatetimeIndex(['2021-06-28', '2021-06-29', '2021-06-30', '2021-07-01',
               '2021-07-02', '2021-07-03'],
              dtype='datetime64[ns]', freq='D')

In [79]:
df.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [81]:
# 차후에 ML/DL 시에 데이터 구조를 한눈에 보아야 함

df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2021-06-28 to 2021-07-03
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       6 non-null      float64
 1   b       6 non-null      float64
 2   c       6 non-null      float64
 3   d       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [82]:
# 기초 통계 함수
# 가령 빌게이츠의 급여가 포함된 동네 주민의 급여들이 활용 데이터라 할 경우
# 이상치 or 결측치 확인을 위해서 기초 통계로 보고 max()에서
# 빌게이츠 급여와 75% 지점의 차이가 너무 크면 이상치로 간주하는 분석 기법도 있음

df.describe()

              a         b         c         d
count  6.000000  6.000000  6.000000  6.000000
mean   0.006105 -0.310579 -0.548508 -0.495911
std    1.547628  0.627841  0.868498  1.250990
min   -2.362943 -1.140927 -1.326453 -2.647576
25%   -0.622657 -0.552102 -1.195621 -1.043001
50%   -0.147644 -0.398714 -0.679466  0.079721
75%    1.246552 -0.158970 -0.346539  0.351654
max    1.764573  0.757169  0.997574  0.487611

In [84]:
# b컬럼에 대한 오름차순 정렬 설정
# 오름차순 ascending=True / 내림차순 ascending=False
df.sort_values(by='b', ascending=True)

                   a         b         c         d
2021-06-29 -0.578794 -1.140927 -0.335001  0.370539
2021-07-02  1.764573 -0.573051 -0.977779  0.294996
2021-06-28  1.567567 -0.489256 -1.268235 -2.647576
2021-07-03  0.283506 -0.308172  0.997574 -1.345483
2021-06-30 -2.362943 -0.109236 -0.381152 -0.135555
2021-07-01 -0.637277  0.757169 -1.326453  0.487611

In [87]:
# 특정 컬럼 값만 도출
# [] 연산자와 컬럼명으로 컬럼 도출

df['a']

2021-06-28    1.567567
2021-06-29   -0.578794
2021-06-30   -2.362943
2021-07-01   -0.637277
2021-07-02    1.764573
2021-07-03    0.283506
Freq: D, Name: a, dtype: float64

In [90]:
#dot 연사자를 활용한 특정 컬럼 검색
df.a

2021-06-28    1.567567
2021-06-29   -0.578794
2021-06-30   -2.362943
2021-07-01   -0.637277
2021-07-02    1.764573
2021-07-03    0.283506
Freq: D, Name: a, dtype: float64

In [88]:
df['a', 'b']

KeyError: ('a', 'b')

In [89]:
#하나 이상의 컬럼들은 list 구조로 요청
#df[] : 특정 컬럼을 도출하는 것을 의미하는 문법
# ['a', 'b'] = a와 b 컬럼 의미
# 다중 컬럼 검색시 반드시 list로 변환해서 작업

df[['a', 'b']]

                   a         b
2021-06-28  1.567567 -0.489256
2021-06-29 -0.578794 -1.140927
2021-06-30 -2.362943 -0.109236
2021-07-01 -0.637277  0.757169
2021-07-02  1.764573 -0.573051
2021-07-03  0.283506 -0.308172

In [91]:
# index로 데이터 검색(도출)

df.index

DatetimeIndex(['2021-06-28', '2021-06-29', '2021-06-30', '2021-07-01',
               '2021-07-02', '2021-07-03'],
              dtype='datetime64[ns]', freq='D')

In [93]:
# :을 기준으로 하여 slicing하여 데이터 도출
# index 명으로 
df['2021-06-28' : '2021-07-01'] #시작일 ~ 끝

                   a         b         c         d
2021-06-28  1.567567 -0.489256 -1.268235 -2.647576
2021-06-29 -0.578794 -1.140927 -0.335001  0.370539
2021-06-30 -2.362943 -0.109236 -0.381152 -0.135555
2021-07-01 -0.637277  0.757169 -1.326453  0.487611

In [94]:
#index의 위치값인 순번(index)으로 데이터 도출
# [0 : 4] >> index 0 ~ 3까지
df[0:4]

                   a         b         c         d
2021-06-28  1.567567 -0.489256 -1.268235 -2.647576
2021-06-29 -0.578794 -1.140927 -0.335001  0.370539
2021-06-30 -2.362943 -0.109236 -0.381152 -0.135555
2021-07-01 -0.637277  0.757169 -1.326453  0.487611

In [98]:
# iloc 라는 속성 : index location의 약어
# iloc[indexs, columns]
df.iloc[0:2, 0:2]

                   a         b
2021-06-28  1.567567 -0.489256
2021-06-29 -0.578794 -1.140927

### file로 부터 데이터 read해서 date 타입 이해하기

In [99]:
!dir

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: 68E6-ADB4

 C:\202105_lab\07.PythonLib 디렉터리

2021-06-28  오후 12:41    <DIR>          .
2021-06-28  오후 12:41    <DIR>          ..
2021-06-28  오후 12:31    <DIR>          .ipynb_checkpoints
2021-06-28  오전 09:42             1,749 0628_학습내영.txt
2021-06-28  오전 10:13    <DIR>          dataset
2021-06-28  오후 12:41            57,531 step01_PandasBasic_s.ipynb
2021-06-28  오후 12:31            26,947 step02_PandasReview_s.ipynb
               3개 파일              86,227 바이트
               4개 디렉터리  13,948,776,448 바이트 남음

In [102]:
# 01.date_data.csv
# csv 파일의 내용을 read하면서 dataframe 객체를 생성
# DataFrane 객체의 장점은 다양한 함수가 있어서 조작 및 정제 가능

# 가정사항: csv 파일은 제공 받음, 단 raw는 보존, 정제 및 분석을 위해서는 최적인 상태로 가공 필수
# 문제점 찾기 - \t? at(@)

df = pd.read_csv('dataset/01.date_data.csv')
df

   Name             Birth                  email
0   이순신   2021-01-01 9:10       happy@gmail.com
1   홍길동   2021-01-08 9:20         1004@NAVER.COM
2   유관순  2021-02-01 10:20   Iron at yahoo.co.kr
3    이이  2021-02-02 11:40        \tlee@gmail.com
4    김구  2021-02-28 15:10         kim@daum.net\t
5   윤봉길  2021-04-10 19:20        yeon@daum.ac.kr
6   강감찬  2021-06-30 21:20          kkc@gmail.com
7  신사임당  2021-07-20 23:30     monther@NAVER.COM
8  을지문덕  2021-08-28 11:48          ygmd@daum.net
9   유재석   2021-09-01 3:12       yjs at gmail.com

In [103]:
#dftypes : 문자열 타입을 object 타입으로 표현

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   Birth   10 non-null     object
 2   email   10 non-null     object
dtypes: object(3)
memory usage: 368.0+ bytes

In [105]:
# format='%Y-%m-%d %H:%M:%S'

df.columns

Index(['Name', 'Birth', 'email'], dtype='object')

In [106]:
df.values

array([['이순신', '2021-01-01 9:10', 'happy@gmail.com '],
       ['홍길동', '2021-01-08 9:20', '  1004@NAVER.COM'],
       ['유관순', '2021-02-01 10:20', ' Iron at yahoo.co.kr '],
       ['이이', '2021-02-02 11:40', '\tlee@gmail.com'],
       ['김구', '2021-02-28 15:10', 'kim@daum.net\t'],
       ['윤봉길', '2021-04-10 19:20', 'yeon@daum.ac.kr'],
       ['강감찬', '2021-06-30 21:20', 'kkc@gmail.com'],
       ['신사임당', '2021-07-20 23:30', 'monther@NAVER.COM '],
       ['을지문덕', '2021-08-28 11:48', '    ygmd@daum.net'],
       ['유재석', '2021-09-01 3:12', 'yjs at gmail.com']], dtype=object)

In [108]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [110]:
df['Birth']

0     2021-01-01 9:10
1     2021-01-08 9:20
2    2021-02-01 10:20
3    2021-02-02 11:40
4    2021-02-28 15:10
5    2021-04-10 19:20
6    2021-06-30 21:20
7    2021-07-20 23:30
8    2021-08-28 11:48
9     2021-09-01 3:12
Name: Birth, dtype: object

In [111]:
df.Birth

0     2021-01-01 9:10
1     2021-01-08 9:20
2    2021-02-01 10:20
3    2021-02-02 11:40
4    2021-02-28 15:10
5    2021-04-10 19:20
6    2021-06-30 21:20
7    2021-07-20 23:30
8    2021-08-28 11:48
9     2021-09-01 3:12
Name: Birth, dtype: object

In [112]:
#문자열 타입의 object 타입을 datetime 타입으로 변환하는 구조
df['Birth'] = pd.to_datetime(df['Birth'], format='%Y-%m-%d %H:%M:%S')
df

   Name               Birth                  email
0   이순신 2021-01-01 09:10:00       happy@gmail.com
1   홍길동 2021-01-08 09:20:00         1004@NAVER.COM
2   유관순 2021-02-01 10:20:00   Iron at yahoo.co.kr
3    이이 2021-02-02 11:40:00        \tlee@gmail.com
4    김구 2021-02-28 15:10:00         kim@daum.net\t
5   윤봉길 2021-04-10 19:20:00        yeon@daum.ac.kr
6   강감찬 2021-06-30 21:20:00          kkc@gmail.com
7  신사임당 2021-07-20 23:30:00     monther@NAVER.COM
8  을지문덕 2021-08-28 11:48:00          ygmd@daum.net
9   유재석 2021-09-01 03:12:00       yjs at gmail.com

In [113]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   Birth   10 non-null     datetime64[ns]
 2   email   10 non-null     object
dtypes: datetime64[ns](1), object(2)
memory usage: 368.0+ bytes

In [118]:
# '2019-01-01' : 문자열
# pd.to_datetime('2019-01-01') : 문자열을 datetime 즉 날짜 표현 타입으로 변환
# - : 경과일

eday = df['Birth'] - pd.to_datetime('2019-01-01')
eday

0   731 days 09:10:00
1   738 days 09:20:00
2   762 days 10:20:00
3   763 days 11:40:00
4   789 days 15:10:00
5   830 days 19:20:00
6   911 days 21:20:00
7   931 days 23:30:00
8   970 days 11:48:00
9   974 days 03:12:00
Name: Birth, dtype: timedelta64[ns]

###  경과일 계산

- timedelta64[??] : 날짜의 덧셈과 뺄셈에 유용
  - Y : 연 
  - M : 월 
  - D : 일 
  - m : 분 
  - s : 초

In [122]:
# 경과일을 일을 기준으로 일 데이터만 도출
# 아쉬운 점 : 소수점 이하 표현이 의미가 없을 경우 삭제 시도 astype() 함수로 체이닝 기술 적용
eday.astype('timedelta64[D]')

0    731.0
1    738.0
2    762.0
3    763.0
4    789.0
5    830.0
6    911.0
7    931.0
8    970.0
9    974.0
Name: Birth, dtype: float64

In [125]:
#최종적으론 int로 정제
eday.astype('timedelta64[D]').astype('int')

0    731
1    738
2    762
3    763
4    789
5    830
6    911
7    931
8    970
9    974
Name: Birth, dtype: int32

## 인덱서(indexer)

### iloc(index location)
- 데이터 프레임의 부분집합 선택을 위한 도구
- iloc는 정수로만 선택
- 여러 개의 정수 위치를 선택하려면 리스트 전달
- 동일한 간격으로 선택하려면 슬라이스 표기
- iloc[index] or iloc[index, column]

In [126]:
df = pd.read_csv('dataset/01.date_data.csv')
df

   Name             Birth                  email
0   이순신   2021-01-01 9:10       happy@gmail.com
1   홍길동   2021-01-08 9:20         1004@NAVER.COM
2   유관순  2021-02-01 10:20   Iron at yahoo.co.kr
3    이이  2021-02-02 11:40        \tlee@gmail.com
4    김구  2021-02-28 15:10         kim@daum.net\t
5   윤봉길  2021-04-10 19:20        yeon@daum.ac.kr
6   강감찬  2021-06-30 21:20          kkc@gmail.com
7  신사임당  2021-07-20 23:30     monther@NAVER.COM
8  을지문덕  2021-08-28 11:48          ygmd@daum.net
9   유재석   2021-09-01 3:12       yjs at gmail.com

In [136]:
print(df.iloc[0,1])
print(df.iloc[3,0])

2021-01-01 9:10
이이

In [138]:
df.iloc[1:3, 0]

1    홍길동
2    유관순
Name: Name, dtype: object

In [141]:
df.iloc[4, 2]

'kim@daum.net\t'

In [142]:
df.iloc[1:3, :]

  Name             Birth                  email
1  홍길동   2021-01-08 9:20         1004@NAVER.COM
2  유관순  2021-02-01 10:20   Iron at yahoo.co.kr

### loc 속성

- 데이터들을 slicing 하는 기술
- loc[index, columns]
- loc는 레이블로만 선택
- 여러 개의 레이블을 선택하려면 리스트 전달
- 동일한 간격으로 선택하려면 슬라이스 표기 사용
- 마지막 레이블까지 포함

In [156]:
df = pd.read_csv('dataset/01.date_data.csv')
df.head()

  Name             Birth                  email
0  이순신   2021-01-01 9:10       happy@gmail.com
1  홍길동   2021-01-08 9:20         1004@NAVER.COM
2  유관순  2021-02-01 10:20   Iron at yahoo.co.kr
3   이이  2021-02-02 11:40        \tlee@gmail.com
4   김구  2021-02-28 15:10         kim@daum.net\t

In [149]:
df.loc[:, ['Name', 'Birth']]

   Name             Birth
0   이순신   2021-01-01 9:10
1   홍길동   2021-01-08 9:20
2   유관순  2021-02-01 10:20
3    이이  2021-02-02 11:40
4    김구  2021-02-28 15:10
5   윤봉길  2021-04-10 19:20
6   강감찬  2021-06-30 21:20
7  신사임당  2021-07-20 23:30
8  을지문덕  2021-08-28 11:48
9   유재석   2021-09-01 3:12

In [152]:
# 데이터 수정
print(df.iloc[0, 0])
print(df.loc[0, 'Name'])

df.loc[0, 'Name'] = '김순신'
df.head()

이순신
이순신

  Name             Birth                  email
0  김순신   2021-01-01 9:10       happy@gmail.com
1  홍길동   2021-01-08 9:20         1004@NAVER.COM
2  유관순  2021-02-01 10:20   Iron at yahoo.co.kr
3   이이  2021-02-02 11:40        \tlee@gmail.com
4   김구  2021-02-28 15:10         kim@daum.net\t

In [162]:
# 새로운 시리즈(컬럼) 추가
df = pd.read_csv('dataset/01.date_data.csv')
df['age'] = [20, 24, 23, 26, 34, 46, 29, 30, 41, 27]
df

   Name             Birth                  email  age
0   이순신   2021-01-01 9:10       happy@gmail.com    20
1   홍길동   2021-01-08 9:20         1004@NAVER.COM   24
2   유관순  2021-02-01 10:20   Iron at yahoo.co.kr    23
3    이이  2021-02-02 11:40        \tlee@gmail.com   26
4    김구  2021-02-28 15:10         kim@daum.net\t   34
5   윤봉길  2021-04-10 19:20        yeon@daum.ac.kr   46
6   강감찬  2021-06-30 21:20          kkc@gmail.com   29
7  신사임당  2021-07-20 23:30     monther@NAVER.COM    30
8  을지문덕  2021-08-28 11:48          ygmd@daum.net   41
9   유재석   2021-09-01 3:12       yjs at gmail.com   27

- file로부터 데이터 read해서 DataFrame
- DataFrame의 특정 데이터값 추출
- DataFrame의 특정 데이터값 수정
- 새로운 Series 추가
- 결측치 처리 (대체 : fillna() / 삭제 : dropna() )

In [163]:
del df['age']
df

   Name             Birth                  email
0   이순신   2021-01-01 9:10       happy@gmail.com
1   홍길동   2021-01-08 9:20         1004@NAVER.COM
2   유관순  2021-02-01 10:20   Iron at yahoo.co.kr
3    이이  2021-02-02 11:40        \tlee@gmail.com
4    김구  2021-02-28 15:10         kim@daum.net\t
5   윤봉길  2021-04-10 19:20        yeon@daum.ac.kr
6   강감찬  2021-06-30 21:20          kkc@gmail.com
7  신사임당  2021-07-20 23:30     monther@NAVER.COM
8  을지문덕  2021-08-28 11:48          ygmd@daum.net
9   유재석   2021-09-01 3:12       yjs at gmail.com

### 이미 존재하는 파일의 내용을 기반으로 DataFrame 생성하기

In [164]:
df = pd.read_csv('dataset/02.friends.csv')
df

    이름  나이   직업  hobby
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [169]:
print(type(df))
print(df.loc[3, '나이'])

<class 'pandas.core.frame.DataFrame'>
45

In [172]:
df = pd.read_csv('dataset/03.friendsTab.txt')
print(df)
# 문제점 발견 : tab으로 데이터 구분 (tab seperated value(tsv)), 확장자 = *.tsv
# 포맷은 문제가 없으나 DataFrame으로 변환시ㅔ 문제 발생
# 해결책 : read.csv에 구분자 속성을 tab이라고 명시해준다!
print('********************************')
df = pd.read_csv('dataset/03.friendsTab.txt', delimiter='\t')
print(df)

     이름\t나이\t직업\thobby
0  신동엽\t20\t연예인\tmusic
1     유재석\t41\t교수\tart
2   김새롬\t18\t학생\tstudy
3   이영자\t45\t상담사\ttalk
4   강호동\t38\t연예인\ttalk
********************************
    이름  나이   직업  hobby
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [175]:
df = pd.read_csv('dataset/04.friendsTabNoHead.txt', delimiter='\t')
print(df)

#문제점 : 데이터가 마치 header처럼 쓰이고 있음
#해결 : 새로운 컬럼명 추가

   신동엽  20  연예인  music
0  유재석  41   교수    art
1  김새롬  18   학생  study
2  이영자  45  상담사   talk
3  강호동  38  연예인   talk

In [178]:
#header가 없는 외부파일 read시에 header 미적용 설정
#데이터가 column으로 적용되지 않음
df = pd.read_csv('dataset/04.friendsTabNoHead.txt', delimiter='\t', header = None)
print(df)
print('===========================')

#header 정보 추가!
#names 라는 속성으로 header 추가~
df = pd.read_csv('dataset/04.friendsTabNoHead.txt', delimiter='\t', names=['이름', '나이', '직업', '취미'])
print(df)

     0   1    2      3
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk
===========================
    이름  나이   직업     취미
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [180]:
#급여 series 추가(단, 학생의 경우 급여는 no로 변환, 학생이 아닌 경우 yes로 변환)
#값에 따른 데이터 적용(조건별 값 차별화)

df['sal'] = 0 
df

    이름  나이   직업     취미  sal
0  신동엽  20  연예인  music    0
1  유재석  41   교수    art    0
2  김새롬  18   학생  study    0
3  이영자  45  상담사   talk    0
4  강호동  38  연예인   talk    0

In [184]:
# 직업이 학생인 경우 >> sal에 no
# 직업이 학생이 아닌 경우 >> sal에 yes
# 3항 연산자 : 조건식 ? 조건식이 true인 경우 실행, 조건식이 false인 경우 실행
print(df['직업'] == '학생')

# 삼항 연산식을 numpy의 where 함수의 parameter 적용시 synrax
# np.where(조건식, (조건식이 true인 경우 반환), (조건식이 false인 경우 반환))

df['sal'] = np.where(df['직업'] != '학생', 'yes', 'no')
df

0    False
1    False
2     True
3    False
4    False
Name: 직업, dtype: bool

    이름  나이   직업     취미  sal
0  신동엽  20  연예인  music  yes
1  유재석  41   교수    art  yes
2  김새롬  18   학생  study   no
3  이영자  45  상담사   talk  yes
4  강호동  38  연예인   talk  yes

### python 데이터로 DataFrane 객체로 변환하기

- dict의 key를 DataFrame의 Series로 자동변환
- 차후 데이터 수집 및 관리 시에 어떤 구조로 데이터를 수집하고 취합해야 하는지 설계 가능

In [173]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'}]
type(friend_dict_list)

friend_dict_list

[{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
 {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
 {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
 {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
 {'name': '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'}]

In [185]:
df = pd.DataFrame(friend_dict_list)
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

### 중복 데이터 제거 기술

In [186]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'}]

df = pd.DataFrame(friend_dict_list)
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [188]:
#중복 데이터 여부 확인하는 함수 : duplicated()
#결과 값이 True인 row값 삭제! 
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [191]:
df = df.drop_duplicates()
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [192]:
# step02 - 속성으로 선별해서 삭제

friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'}]

df = pd.DataFrame(friend_dict_list)
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [193]:
#keep 속성으로 마지막 중복 데이터는 유지하고 첫번째 데이터 삭제

df.drop_duplicates(keep='last')

  name  age  job  hobby
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [194]:
# step03 - 동명이인일 경우에 선별해서 삭제

friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': 50, 'job': '연예인', 'hobby': 'music'}]

df = pd.DataFrame(friend_dict_list)
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   50  연예인  music

In [197]:
#원본 데이터 프레임에서 수정해서 새로 생던된 DaraFrame 객체
#df에 대입하지 않을 경우 원본 유지되는 구조

df.drop_duplicates('name', keep='last')

  name  age  job  hobby
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   50  연예인  music

In [198]:
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   50  연예인  music

In [199]:
# step04 - 원본 DataFrame 자체에 수정 사항 바로 반영하는 속성

friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': 50, 'job': '연예인', 'hobby': 'music'}]

df = pd.DataFrame(friend_dict_list)
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   50  연예인  music

In [202]:
#inplace = True : 원본에 실제 변경 사항을 여과 없이 적용, 원본 수정
df.drop_duplicates('name', keep='last', inplace=True)
df

  name  age  job  hobby
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   50  연예인  music

### 결측치 처리

In [203]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby': 'music'}]
df = pd.DataFrame(friend_dict_list)
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽   NaN  연예인  music

In [204]:
# index명 5라는 위치의 신동엽의 age는 결측치
# info()로 non-null 값으로 결측치 여부 확인 가능

#결측치를 어떻게 처리할까?
#age는 절대 결측치일리가 없음
#age의 non은 어떻게 할까 >> 평균? 중앙? 최빈?

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     5 non-null      float64
 2   job     6 non-null      object
 3   hobby   6 non-null      object
dtypes: float64(1), object(3)
memory usage: 320.0+ bytes

In [206]:
#결측치 치환
df.isnull()

    name    age    job  hobby
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False   True  False  False

In [208]:
df['age'].mean()

32.4

In [209]:
df['age'].max()

45.0

In [210]:
df['age'].fillna(df['age'].mean(), inplace = True)
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽  32.4  연예인  music

### 그룹화 하기

In [282]:
# None 값을 0 값으로 치환

friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby': 'music'},
                   ]

df = pd.DataFrame(friend_dict_list)
df


df = pd.DataFrame(friend_dict_list)
df['age'].fillna(df['age'].mean(), inplace = True)
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽  32.4  연예인  music

In [283]:
df.groupby('job')

1. job 종류 확인 : unique()
2. job 별 개수 확인 :  value_counts()

In [284]:
df['job'].value_counts()

연예인    3
상담사    1
학생     1
교수     1
Name: job, dtype: int64

In [285]:
df['hobby'].value_counts()

talk     2
music    2
study    1
art      1
Name: hobby, dtype: int64

In [286]:
df.groupby('hobby').sum()

        age
hobby
art    41.0
music  52.4
study  18.0
talk   83.0

In [287]:
df['job'].unique()

array(['연예인', '교수', '학생', '상담사'], dtype=object)

In [288]:
df.iloc[5, 1] = np.nan
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽   NaN  연예인  music

In [289]:
#결측치를 중앙값으로 대체
df['age'] = df.groupby('job')['age'].transform('median')
df['age'].fillna(df[df['job'] == '연예인']['age'].median, inplace=True)
df

  name   age  job  hobby
0  신동엽  29.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  29.0  연예인   talk
5  신동엽  29.0  연예인  music

In [257]:
# 데이터 제공

friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name': '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby': 'music'},
                    {'name': '고현정', 'age': 44, 'job': '가수', 'hobby': 'music'},
                    {'name': '박민영', 'age': 22, 'job': '학생', 'hobby': 'art'},
                    {'name': '박서준', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '박보검', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name': '이효리', 'age': 28, 'job': '교수', 'hobby': 'talk'},
                    {'name': '이상순', 'age': 29, 'job': '주부', 'hobby': 'music'}]

df = pd.DataFrame(friend_dict_list)
df

   name   age  job  hobby
0   신동엽  20.0  연예인  music
1   유재석  41.0   교수    art
2   김새롬  18.0   학생  study
3   이영자  45.0  상담사   talk
4   강호동  38.0  연예인   talk
5   신동엽   NaN  연예인  music
6   고현정  44.0   가수  music
7   박민영  22.0   학생    art
8   박서준  18.0   학생  study
9   박보검  45.0  상담사   talk
10  이효리  28.0   교수   talk
11  이상순  29.0   주부  music

### 조건 기반 필터링

- Pandas의 비교 및 논리 연산자
- 비교 연산자는 기본 연산자를 사용
- AND : &
- OR : |
- NOT : ~
- 논리 연산에 기본 연산자를 사용할 경우 객체
전체의 참을 계산하기 때문에 오류 발생
- 각 표현은 괄호로 묶는 것은 권장

In [259]:
df.name == '신동엽'

0      True
1     False
2     False
3     False
4     False
5      True
6     False
7     False
8     False
9     False
10    False
11    False
Name: name, dtype: bool

In [261]:
f1 = df.name == '김새롬'
print(f1)
f2 = df.job == '학생'
print(f2)

f1 & f2

0     False
1     False
2      True
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
Name: name, dtype: bool
0     False
1     False
2      True
3     False
4     False
5     False
6     False
7      True
8      True
9     False
10    False
11    False
Name: job, dtype: bool

0     False
1     False
2      True
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
dtype: bool

In [262]:
df2 = df[f1 & f2]
df2

  name   age job  hobby
2  김새롬  18.0  학생  study

<hr>

**미션**
1. hobby 종류 확인
2. hobby 종류의 총수 확인
3. 종류별 개수

In [275]:

friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby': 'music'},
                   ]

df = pd.DataFrame(friend_dict_list)
df['age'].fillna(df['age'].mean(), inplace = True)
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽  32.4  연예인  music

In [279]:
#hobby 종류 확인
print(df.hobby.unique())
print('---------------')

#hobby 종류의 총수 확인
print(len(df.hobby.unique()))
print('---------------')

#종류별 개수
print(df.hobby.value_counts())
print('---------------')

['music' 'art' 'study' 'talk']
---------------
4
---------------
talk     2
music    2
study    1
art      1
Name: hobby, dtype: int64
---------------

### 두개의 DataFrame 병합하기 - row 기준

In [290]:
l1 = [{'name': '이효리', 'job': "교수"},
      {'name': '이상순', 'job': "학생"},
      {'name': '박보검', 'job': "개발자"}]

l2 = [{'name': '신동엽', 'job': "치과의사"},
      {'name': '이영자', 'job': "농부"},
      {'name': '정찬우', 'job': "연예인"}]

In [295]:
l1

[{'name': '이효리', 'job': '교수'},
 {'name': '이상순', 'job': '학생'},
 {'name': '박보검', 'job': '개발자'}]

In [297]:
# list를 기준으로 DataFrame 생성, columns 속성으로 컬럼명을 명시
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

print(df1)
print(type(df1))
print(df1.ndim)
print(df1.shape)

print('-'*20)

print(df2)

  name  job
0  이효리   교수
1  이상순   학생
2  박보검  개발자
<class 'pandas.core.frame.DataFrame'>
2
(3, 2)
--------------------
  name   job
0  신동엽  치과의사
1  이영자    농부
2  정찬우   연예인

In [292]:
# concat( [결합시킬 데이터], axis, ignore_index = True) : 결합함수
# 결합시킬 데이터 = list / axis=0(위아래), 1(좌우) / ignore_index = True 
df_all = pd.concat([df1, df2], axis = 1)
df_all

  name  job name   job
0  이효리   교수  신동엽  치과의사
1  이상순   학생  이영자    농부
2  박보검  개발자  정찬우   연예인

In [293]:
#두 개의 dataframe을 하나로 결합(merge)

df_all = pd.concat([df1, df2], axis=0)
df_all

  name   job
0  이효리    교수
1  이상순    학생
2  박보검   개발자
0  신동엽  치과의사
1  이영자    농부
2  정찬우   연예인

In [294]:
df_all = pd.concat([df1, df2], axis=0, ignore_index=True)
df_all

  name   job
0  이효리    교수
1  이상순    학생
2  박보검   개발자
3  신동엽  치과의사
4  이영자    농부
5  정찬우   연예인